VMs/Results/Suricata/Fio/results_3.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43808: Tue Dec 10 17:50:47 2024
  read: IOPS=1488, BW=5955KiB/s (6098kB/s)(1745MiB/300002msec)
    slat (usec): min=11, max=18937, avg=220.85, stdev=496.20
    clat (usec): min=3, max=12661, avg=363.52, stdev=518.94
     lat (usec): min=16, max=20211, avg=632.56, stdev=746.76
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   25], 40.00th=[  269], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  478], 90.00th=[  693], 95.00th=[ 1029],
     | 99.00th=[ 2671], 99.50th=[ 3556], 99.90th=[ 5604], 99.95th=[ 6652],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2733, max= 9840, per=25.03%, avg=5963.43, stdev=1199.88, samples=598
   iops        : min=  683, max= 2460, avg=1490.63, stdev=299.96, samples=598
  lat (usec)   : 4=0.09%, 10=20.57%, 20=8.42%, 50=1.81%, 100=0.74%
  lat (usec)   : 250=2.93%, 500=46.98%, 750=9.90%, 1000=3.37%
  lat (msec)   : 2=3.45%, 4=1.39%, 10=0.35%, 20=0.01%
  cpu          : usr=5.14%, sys=34.08%, ctx=515173, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=446648,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43809: Tue Dec 10 17:50:47 2024
  read: IOPS=1476, BW=5906KiB/s (6047kB/s)(1730MiB/300001msec)
    slat (usec): min=10, max=11858, avg=222.90, stdev=496.20
    clat (usec): min=3, max=14997, avg=365.00, stdev=517.25
     lat (usec): min=15, max=15968, avg=637.27, stdev=746.63
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   26], 40.00th=[  269], 50.00th=[  306], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  482], 90.00th=[  701], 95.00th=[ 1037],
     | 99.00th=[ 2638], 99.50th=[ 3490], 99.90th=[ 5538], 99.95th=[ 6587],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2451, max= 9301, per=24.80%, avg=5910.22, stdev=1242.70, samples=598
   iops        : min=  612, max= 2325, avg=1477.31, stdev=310.64, samples=598
  lat (usec)   : 4=0.09%, 10=20.31%, 20=8.54%, 50=1.92%, 100=0.74%
  lat (usec)   : 250=3.02%, 500=46.53%, 750=10.09%, 1000=3.51%
  lat (msec)   : 2=3.48%, 4=1.43%, 10=0.34%, 20=0.01%
  cpu          : usr=5.03%, sys=34.03%, ctx=512223, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=442923,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43810: Tue Dec 10 17:50:47 2024
  read: IOPS=1473, BW=5892KiB/s (6034kB/s)(1726MiB/300000msec)
    slat (usec): min=10, max=13800, avg=224.53, stdev=502.22
    clat (usec): min=3, max=11906, avg=365.23, stdev=520.40
     lat (usec): min=16, max=19167, avg=638.31, stdev=752.29
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   27], 40.00th=[  269], 50.00th=[  302], 60.00th=[  338],
     | 70.00th=[  383], 80.00th=[  482], 90.00th=[  701], 95.00th=[ 1029],
     | 99.00th=[ 2638], 99.50th=[ 3556], 99.90th=[ 5735], 99.95th=[ 6652],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 3014, max= 9277, per=24.75%, avg=5897.30, stdev=1202.60, samples=598
   iops        : min=  753, max= 2319, avg=1474.08, stdev=300.67, samples=598
  lat (usec)   : 4=0.03%, 10=19.13%, 20=9.71%, 50=1.91%, 100=0.87%
  lat (usec)   : 250=3.10%, 500=46.37%, 750=10.14%, 1000=3.52%
  lat (msec)   : 2=3.49%, 4=1.38%, 10=0.36%, 20=0.01%
  cpu          : usr=5.20%, sys=33.99%, ctx=510761, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=441925,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43811: Tue Dec 10 17:50:47 2024
  read: IOPS=1518, BW=6073KiB/s (6219kB/s)(1779MiB/300001msec)
    slat (usec): min=10, max=16613, avg=216.39, stdev=482.02
    clat (usec): min=3, max=11021, avg=353.84, stdev=496.55
     lat (usec): min=15, max=18923, avg=620.15, stdev=723.18
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   24], 40.00th=[  269], 50.00th=[  302], 60.00th=[  334],
     | 70.00th=[  379], 80.00th=[  465], 90.00th=[  668], 95.00th=[  971],
     | 99.00th=[ 2507], 99.50th=[ 3425], 99.90th=[ 5473], 99.95th=[ 6390],
     | 99.99th=[ 8291]
   bw (  KiB/s): min= 3001, max= 9336, per=25.51%, avg=6078.46, stdev=1196.27, samples=598
   iops        : min=  750, max= 2334, avg=1519.36, stdev=299.05, samples=598
  lat (usec)   : 4=0.10%, 10=20.67%, 20=8.49%, 50=1.75%, 100=0.78%
  lat (usec)   : 250=3.09%, 500=47.44%, 750=9.69%, 1000=3.21%
  lat (msec)   : 2=3.20%, 4=1.27%, 10=0.31%, 20=0.01%
  cpu          : usr=5.16%, sys=34.49%, ctx=518888, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=455473,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=23.3MiB/s (24.4MB/s), 5892KiB/s-6073KiB/s (6034kB/s-6219kB/s), io=6980MiB (7319MB), run=300000-300002msec

Disk stats (read/write):
  dm-0: ios=1481674/0, merge=0/0, ticks=339532/0, in_queue=339532, util=100.00%

Disk stats (read/write):
  sda: ios=1482394/0, merge=1/0, ticks=344325/0, in_queue=344325, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:50:47 2024
  read: IOPS=5956, BW=23.3Mi (24.4M)(6980MiB/300002msec)
    slat (usec): min=10, max=18937, avg=221.65, stdev=427.35
    clat (usec): min=3, max=14997, avg=362.21, stdev=442.90
     lat (usec): min=15, max=20211, avg=633.17, stdev=641.48
   bw (  KiB/s): min= 8466, max=27914, per=18.77%, avg=17885.98, stdev=1213.35, samples=1794
   iops        : min= 2115, max= 6978, avg=4470.75, stdev=303.33, samples=1794
  lat (usec)   : 4=0.08%, 10=20.18%, 20=8.79%, 50=1.85%, 100=0.78%
  lat (usec)   : 250=3.04%, 500=46.83%, 750=9.95%, 1000=3.40%
  lat (msec)   : 2=3.40%, 4=1.37%, 10=0.34%, 20=0.01%
  cpu          : usr=5.13%, sys=34.15%, ctx=2057045, majf=0, minf=59
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1786969,0,0,0 short=0,0,0,0 dropped=0,0,0,0